{"config": [{"config": {"bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "batch_input_shape": [null, 784], "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "name": "dense_1", "units": 128}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "name": "dense_2", "units": 256}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "name": "dense_3", "units": 256}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "name": "dense_4", "units": 10}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.4", "backend": "tensorflow"}